Управление_торговлей_демо_115.РабочийСтол1С/src/DataProcessors/РабочийСтол/РабочийСтол.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РабочийСтол</name>
</mdclass:DataProcessor>

Управление_торговлей_демо_115.РабочийСтол1С/src/InformationRegisters/РБ_НастройкиРабочегоСтола/РБ_НастройкиРабочегоСтола.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РБ_НастройкиРабочегоСтола</name>
  <resources>
    <name>Настройка</name>
    <type>
      <types>CatalogRef.РБ_ВариантыНастроекРабочегоСтола</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Управление_торговлей_демо_115.РабочийСтол1С/src/DataProcessors/РабочийСтол/Forms/ФормаСохраненияНастройки/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ТекПользователь") Тогда
		ТекПользователь = Параметры.ТекПользователь;
	КонецЕсли;
	Если Параметры.Свойство("АдресНастройки") Тогда
		АдресНастройки = Параметры.АдресНастройки;
	КонецЕсли;
	НастроитьВидимостьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура МетодСохраненияПриИзменении(Элемент)
	МетодСохраненияПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура МетодСохраненияПриИзмененииНаСервере()
	НастроитьВидимостьЭлементов();
КонецПроцедуры

&НаСервере
Процедура НастроитьВидимостьЭлементов()
	Элементы.Пользователи.Видимость = МетодСохранения = 1;
КонецПроцедуры

&НаКлиенте
Процедура КомандаПодобрать(Команда)
	ВыбратьПодобратьПользователейЗавершение();
КонецПроцедуры
&НаСервере
Функция СписокПользователей()
	Возврат Пользователи.Выгрузить().ВыгрузитьКолонку("Пользователь");
КонецФункции

&НаКлиенте
Процедура ВыбратьПодобратьПользователейЗавершение() Экспорт

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("ТекущаяСтрока", ?(
		Элементы.Пользователи.ТекущиеДанные = Неопределено, Неопределено,
		Элементы.Пользователи.ТекущиеДанные.Пользователь));
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
	ПараметрыФормы.Вставить("МножественныйВыбор", Истина);
	ПараметрыФормы.Вставить("РасширенныйПодбор", Истина);
	ПараметрыФормы.Вставить("ПараметрыРасширеннойФормыПодбора", Неопределено);
	ПараметрыФормы.Вставить("ВыборГруппПользователей", Истина);
	ПараметрыФормы.Вставить("ВыбранныеПользователи", СписокПользователей());
	ПараметрыФормы.Вставить("ЗаголовокФормыПодбора", Заголовок);
	ОткрытьФорму("Справочник.Пользователи.ФормаВыбора", ПараметрыФормы, Элементы.Пользователи);
КонецПроцедуры
&НаКлиенте
Процедура ПользователиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Пользователи.Очистить();
	Для Каждого Пользователь Из ВыбранноеЗначение Цикл
		СтрокаПользователи = Пользователи.Добавить();
		СтрокаПользователи.Пользователь = Пользователь;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура КомандаСохранить(Команда)
	Оповестить("СохранениеНастроек",СохранитьНаСервере());
	Закрыть();
КонецПроцедуры

&НаСервере
Функция СохранитьНаСервере()
	НачатьТранзакцию();
	Попытка
		ТаблицаОбъектов = ПолучитьИзВременногоХранилища(АдресНастройки);
		Настройка = Новый ХранилищеЗначения(ТаблицаОбъектов);
		РегистрыСведений.РБ_НастройкиРабочегоСтола.ЗаписатьНастройкиРабочегоСтола(ТекПользователь, 
		Настройка);
		РегистрыСведений.РБ_НастройкиРабочегоСтола.ЗаписатьНастройкиРабочегоСтола(СписокПользователей(), 
		Настройка);
		РезультатСохранения = "Настройки успешно сохранены!";
		ЗафиксироватьТранзакцию();
	Исключение
		РезультатСохранения = "Ошибка сохранения настроек! " + ОписаниеОшибки();
		ОтменитьТранзакцию();
	КонецПопытки;
	
	Возврат РезультатСохранения;
	
КонецФункции
